// pages/mineRefund/mineRefund.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    orderList: [{
      name: '商品名称111商品名称111商品名称111商品名称111商品名称111商品名称111商品名称111商品名称111',
      img: '/image/组47.png',
      orderNum: '123456789987',
      itemSet: '商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格',
      time: '2019-12-12 12:12',
      type: 0, //退款状态：0等待处理，1已退款，2拒绝退款
    }, {
      name: '商品名称111商品名称111商品名称111商品名称111商品名称111商品名称111商品名称111商品名称111',
      img: '/image/组47.png',
      orderNum: '123456789987',
      itemSet: '商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格',
      time: '2019-12-12 12:12',
      type: 1, 
    }, {
      name: '商品名称111商品名称111商品名称111商品名称111商品名称111商品名称111商品名称111商品名称111',
      img: '/image/组47.png',
      orderNum: '123456789987',
      itemSet: '商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格商品规格',
      time: '2019-12-12 12:12',
      type: 2, 
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})